"""
博客：https://www.cnblogs.com/liwenzhou/p/7999532.html

css语法：
    选择器{属性1：值1；属性2：值2}
css导入方式：
    1、直接将样式写在标签内部的style属性中 不推荐大规模使用
    2、在head标签中写style标签
    3、将样式单独写在css文件中，通过link标签的href属性导入（在项目中一般使用这种方式）
css选择器（importent jQuery中的选择器类似）：
    1、基本选择器
    2、组合选择器
    3、属性选择器
    4、分组和嵌套
    5、伪类和伪元素
css选择器的优先级：
    1、选择器相同的情况下：
        下面的优先级高，会覆盖
    2、选择器不同的情况下
        内联(1000) > ID选择器（100）> 类选择器（10）> 元素选择器（1）>继承的（0）
css的属性：
    1、高和宽
        只有块儿级标签才能设置宽和高
    字体属性
        字体类别
        字体大小
        字体粗细
        字体颜色
        文字装饰效果
        文字对齐
        文字缩进















： 冒号表示状态
一行展示又有固定宽度
隐藏属性之后 不占页面的位置
没有设置高度 会使用文本的高度
内填充：内容和边框（padding）的距离
margin：外边距 标签和标签之间的距离
两个边距（上变距／下变距 --- 取最大的）
顺时针：上右下左
浮动：
    浮动的副作用：相当于这个元素从文档中拿出来了
    解决浮动的副作用：
        设置父容器的高度
        一个空的div clear属性
        清除浮动的样式类：

溢出：框太小，内容太多

定位：大的布局不变
    相对定位：

    绝对定位：

    固定定位：

    绝对定位和固定定位在文档中已经没有它的位置了（可以被其他元素占用位置）， 相对定位的位置还在





"""
